app/controllers/applications_controller.rb

SELECT "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @application = Application.find(params[:id])